#!/usr/bin/env python3
# coding:utf-8

room = {
    "bbox": [[0, 0], [50000, 80000]],
    "obstacles": [
        [[10000, 20000], [11000, 20500], [10000, 21000], [9000, 20500]],
        [[25000, 40000], [26000, 40500], [25000, 41000], [24000, 40500]],
        [[40000, 60000], [41000, 60500], [40000, 61000], [39000, 60500]]
    ],
    "guards": [
    ],
    "isolates": [
        [[25000, 40000], [26000, 40500], [25000, 41000], [24000, 40500]],
        [[10000, 20000], [11000, 20500], [10000, 21000], [9000, 20500]],
        [[40000, 60000], [41000, 60500], [40000, 61000], [39000, 60500]]
    ],
    "evitables": [
    ]
}

region = ([0, 0], [30000, 40000])

moving_path = {
    "moving_paths": [
        ([0, 30000], [75000, 33000])
    ],
    "blocks": [
        ([27000, 0], [29000, 80000])
    ]
}

# regions moving_path obstacles 均用矩阵列表去描述
history = {
    "rack1": {
        "guard": ([0, 0], [10000, 20000]),
        "obstacle": ([1000, 1000], [9000, 19000]),
        "packages": {},
        "skeleton": {}
    },
    "rack2": {
        "guard": ([0, 20000], [10000, 40000]),
        "obstacle": ([1000, 11000], [9000, 39000]),
        "packages": {},
        "skeleton": {}
    }
}

base_rack = "apr"

info = {
    'direction': {'name': 'direction', 'description': '', 'value': 'rightwards',
                  'choices': ['leftwards', 'upwards', 'rightwards', 'downwards']}
}
